:PROPERTIES:
:ID:       ee2f912a-16a1-40fb-a281-4a2a72abb2fa
:END:
#+title: org-babel(cpp)

* 使用
** 多代码块运行
1. 按照示例完成代码
2. 在子树标题使用[fn:1]：M-x org-babel-tangle
3. 在第3个代码块(bash)：C-c C-c


* 查询
| header arguments | 说明                     |
|------------------+--------------------------|
| :main            | 是否用main函数包裹代码块 |
| :includes        | 包含头文件               |
| :libs            | 链接库文件               |
| :namespaces      | 使用命名空间             |
| :flags           | 编译器参数               |


* 示例
** 两数之和(单代码块)
#+BEGIN_SRC cpp :results output :includes '(<iostream> <vector>) :namespaces std
vector<int> twoSum(vector<int>& nums, int target) {
    int n = nums.size();
    for (int i = 0; i < n; ++i) {
        for (int j = i + 1; j < n; ++j) {
            if (nums[i] + nums[j] == target) {
                return {i, j};
            }
        }
    }
    return {};
}

int main() {
    vector<int> nums = {2, 7, 11, 15};
    int target = 9;
    vector<int> result = twoSum(nums, target);
    if (!result.empty()) {
        cout << "Index: " << result[0] << ", " << result[1] << endl;
    } else {
        cout << "No solution found!" << endl;
    }
    return 0;
}
#+END_SRC

#+RESULTS:
: Index: 0, 1

** TODO 两数之和(单代码块 var)
** 两数字之和(多代码块 tangle)
#+begin_src C++ :tangle ../example/two_Sum.h :includes '(<iostream> <vector>) :main no
std::vector<int> twoSum(std::vector<int>& nums, int target);
#+end_src

#+BEGIN_SRC C++ :tangle ../example/two_sum.cpp :main no
#include <iostream>
#include <vector>

std::vector<int> twoSum(std::vector<int>& nums, int target) {
    int n = nums.size();
    for (int i = 0; i < n; ++i) {
        for (int j = i + 1; j < n; ++j) {
            if (nums[i] + nums[j] == target) {
                return {i, j};
            }
        }
    }
    return {};
}
#+END_SRC

#+BEGIN_SRC C++ :tangle ../example/main.cpp :includes "two_Sum.h"
int main() {
    std::vector<int> nums = {2, 7, 11, 15};
    int target = 9;
    std::vector<int> result = twoSum(nums, target);

    if (!result.empty()) {
        std::cout << "Index: " << result[0] << ", " << result[1] << std::endl;
    } else {
        std::cout << "No solution found!" << std::endl;
    }

    return 0;
}
#+end_src

#+begin_src bash :results output
g++ -o ../example/main ../example/main.cpp ../example/two_sum.cpp && ../example/main
#+end_src

#+RESULTS:
: Index: 0, 1




* 参考 [0/1]
- [ ] [[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-C.html][C, C++, D Source Code Blocks in Org Mode]]

* Footnotes
[fn:1] 这样使得org-babel-tangle作用范围为子树而不是整个文件
